org/notes/web/html.org
#+title: HTML
#+description: Web Development Notes (HTML)
#+setupfile: https://danmi02.github.io/org-html-themes/org/theme-readtheorg.setup
#+property: header-args :exports both :eval never-export
#+options: num:nil tex:t

* [[https://github.com/mdn/beginner-html-site][HyperText Markup Language (HTML) Basics]]
** Comment
#+begin_src html
<!-- This is an HTML comment. -->
#+end_src

** Viewport Element
#+begin_src html
<meta name="viewport" content="width=device-width">
#+end_src

Sets the page to render at width of viewport. Ensures that web pages display properly on mobile devices.

** Anchors (a)
Link to different pages using the =a= (anchor) tag.


#+begin_src html
<a>Link</a>
#+end_src

*** Hypertext Reference (href)
Specify destination of =a= using the =href= attribute.

#+begin_src html
<a href="https://website.com">
    Link
</a>
#+end_src
