notes/web/html.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-15 Sat 12:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTML</title>
<meta name="author" content="Daniel Min" />
<meta name="description" content="Web Development Notes (HTML)" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://danmi02.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">HTML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc36f68a">HyperText Markup Language (HTML) Basics</a>
<ul>
<li><a href="#org27ef2ac">Comment</a></li>
<li><a href="#orgb2c8f59">Viewport Element</a></li>
<li><a href="#org084d46b">Anchors (a)</a>
<ul>
<li><a href="#orgb4dcb25">Hypertext Reference (href)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc36f68a" class="outline-2">
<h2 id="orgc36f68a"><a href="https://github.com/mdn/beginner-html-site">HyperText Markup Language (HTML) Basics</a></h2>
<div class="outline-text-2" id="text-orgc36f68a">
</div>
<div id="outline-container-org27ef2ac" class="outline-3">
<h3 id="org27ef2ac">Comment</h3>
<div class="outline-text-3" id="text-org27ef2ac">
<div class="org-src-container">
<pre class="src src-html"><span style="color: #727072;">&lt;!-- </span><span style="color: #727072;">This is an HTML comment. </span><span style="color: #727072;">--&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2c8f59" class="outline-3">
<h3 id="orgb2c8f59">Viewport Element</h3>
<div class="outline-text-3" id="text-orgb2c8f59">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #A9DC76;">meta</span> <span style="color: #FCFCFA;">name</span>=<span style="color: #FFD866;">"viewport"</span> <span style="color: #FCFCFA;">content</span>=<span style="color: #FFD866;">"width=device-width"</span>&gt;
</pre>
</div>

<p>
Sets the page to render at width of viewport. Ensures that web pages display properly on mobile devices.
</p>
</div>
</div>

<div id="outline-container-org084d46b" class="outline-3">
<h3 id="org084d46b">Anchors (a)</h3>
<div class="outline-text-3" id="text-org084d46b">
<p>
Link to different pages using the <code>a</code> (anchor) tag.
</p>


<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #A9DC76;">a</span>&gt;Link&lt;/<span style="color: #A9DC76;">a</span>&gt;
</pre>
</div>
</div>

<div id="outline-container-orgb4dcb25" class="outline-4">
<h4 id="orgb4dcb25">Hypertext Reference (href)</h4>
<div class="outline-text-4" id="text-orgb4dcb25">
<p>
Specify destination of <code>a</code> using the <code>href</code> attribute.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #A9DC76;">a</span> <span style="color: #FCFCFA;">href</span>=<span style="color: #FFD866;">"https://website.com"</span>&gt;
    Link
&lt;/<span style="color: #A9DC76;">a</span>&gt;
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Min</p>
<p class="date">Created: 2024-06-15 Sat 12:11</p>
</div>
</body>
</html>
